Tauser/NovaPainel/reference/firmware_v3/sdkconfig.defaults
# NovaPanel hardware-first baseline.
# ESP32-P4-WIFI6-Touch-LCD-7B, ESP-IDF 5.5.x.

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_COMPILER_CXX_RTTI=n
# O TWDT fica habilitado, mas sem autoinscrever Idle Tasks no boot. No ESP32-P4
# com IDF 5.5.4 essa inscricao pode duplicar durante o startup multicore.
# CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0 is not set
# CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1 is not set

# Board flash/PSRAM baseline validated during Phase 0.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_SPIRAM=y

# Keep partitions explicit from day one.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y

# Display/LVGL baseline (producao): 1 framebuffer + rotacao 180 por PPA.
# avoid_tearing NAO e usado: e incompativel com sw_rotate/PPA neste BSP, e
# este painel EK79007 (DSI video-mode) nao gira por mirror de hardware,
# entao a rotacao 180 precisa do PPA. O flicker observado e do backlight
# (GPIO32), nao tearing.
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2
# CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR is not set
# CONFIG_BSP_DISPLAY_LVGL_FULL_REFRESH is not set
# CONFIG_BSP_DISPLAY_LVGL_DIRECT_MODE is not set
# CONFIG_LV_BUILD_EXAMPLES is not set
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y

CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Rede/TLS: libera os buffers grandes do TLS apos o handshake (economia de
# RAM interna). Com as requisicoes serializadas (http_gate em http_client),
# evita a pressao de RAM do boot que abria o circuit breaker dos providers.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# Força mbedTLS a usar SRAM interna para handshakes TLS (fragmentos de 16 KB+).
# Impede que a criptografia HTTPS concorra com o DMA do display na PSRAM.
# Nota: verifique se CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC é o nome correto no
# seu ESP-IDF 5.5.x — alternativa: CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y.
CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC=y

# lwIP/TCP-IP: confina o stack de rede ao Core 0 (PRO_CPU).
# Verifique em menuconfig: Component config > LWIP > LWIP task core affinity.
CONFIG_LWIP_TCPIP_TASK_AFFINITY=0x0

# Flash <-> PSRAM dividem o MSPI no ESP32-P4. Um erase/program de flash (NVS
# commit OU gravacao de cache LittleFS depois de cada fetch REST) trava o
# barramento por ms e causa underrun do DMA do MIPI-DSI lendo o framebuffer
# em PSRAM -> flash branco. AUTO_SUSPEND deixa a leitura de cache/PSRAM
# preemptar o erase, mas o flash desta placa e um GD25Q256 (JEDEC C8 4019)
# que NAO esta na lista de chips com suspend validado pela Espressif (boot
# imprime "Suspend and resume may not supported for this flash model yet").
# Como o suspend nao-certificado pode corromper escritas (NVS/cache) em casos
# de borda, fica DESLIGADO. A raiz comum (REST + NVS) e atacada com seguranca
# reduzindo a frequencia de write de flash (throttle do CacheStore + dedup da
# NVS nos services). Reativar so apos um soak de corrupcao no GD25Q256.
# CONFIG_SPI_FLASH_AUTO_SUSPEND is not set
